<!-- dflook/terraform-github-actions {"workspace":"default","backend":"20982b09c61792ef8f14a1fc48dea09142f6ebaa6a60670d5fd650acd857eb0c","backend_type":"s3","plan_job_ref":"Job terraform-plan-05-aws-complete #22 at https://github.com/pipetail/terraform/actions/runs/3549659595","plan_hash":"e8aef7c069c56d52f9cdb5278aac28208c6917489e23fea240b06edd6fa968cb","plan_text_format":"text"} -->
Terraform plan in __examples/05-aws-complete__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.eks.module.eks.kubernetes_config_map.aws_auth[0] will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = {
          + "mapAccounts" = jsonencode([])
          + "mapRoles"    = <<-EOT
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  "rolearn": "arn:aws:iam::175912345102:role/complete-example-prod20221125165657820800000015"
                  "username": "system:node:{{EC2PrivateDNSName}}"
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::175912345102:role/github_actions_terraform"
                  "username": "infrastructure:{{SessionName}}"
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::175912345102:role/eks_administrator"
                  "username": "administrator:{{SessionName}}"
            EOT
          + "mapUsers"    = jsonencode([])
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "Terraform"
              + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
            }
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = <<-EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
            - cluster:
                server: https://2722D4B251FC7EEE3C1F69CB5E87B7CB.gr7.eu-west-1.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvakNDQWVhZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1URXlOVEUyTlRNeU0xb1hEVE15TVRFeU1qRTJOVE15TTFvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBUFpICmE5YkhuTlhYRVpBbm5lNTdMR3JjYTFaRTVyNWV3VHgyYjZFa3pxWHIrV3BadzF0L2FXUWVJRmUwVFZxVFBWN2QKRjJZdGNCZ0QrdXhxb2paeUVvV0d2NzZOS3BFTk1YNVJLTWZNNXlyNHlpZHFrTFM5U3pLd2NBeFNVb3ZKM1diZwpic2tubyswSFI0OXMwVlE1QkFUbGN0SjB6TGN4RDhFc2xJWHlDWldBUjFlZXl4TUwyVnUvd2c4ay9mV3dsZlh6CnNZc0hJbTJMNG1BVEtNSDYvM0tZazAyaDNrTGNHVTNUOSs4eDJkd3ZaMjJaMU5YdC9nY2NaOWNBZVFwR0EwNWEKNmF6VGxNUnZzZXcrT05ML2JxbEdOenpWU0Frck5QZU9JSmZUQ1EwSFY0R3d3MUd4eFhlRVdxQjFqQVE0eHYyegpTOExGaDRJdFhRc24rV0xkY2lzQ0F3RUFBYU5aTUZjd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZMSGJKM1dJNlZxUW8veXJENlVlMnBvVnBCN0dNQlVHQTFVZEVRUU8KTUF5Q0NtdDFZbVZ5Ym1WMFpYTXdEUVlKS29aSWh2Y05BUUVMQlFBRGdnRUJBRGpLVC9MMjAxKy9rY1JtY3FLOQoxWGE1djJWVkwyU1ZBSXJjREU0UTZBb0dVdFArb0R5Qk1RYmpvQ09xanJ0aWZoOHV1S0t6RTdOTy9ac2l0M0VUCjI5QjRsTHF0elZzUEZhVTk3eUJGSm9sMWZyVDZ2N1IxckdkU3B4ZXk2SkhyN2ZSRmJDKzBDdVQ0N2RFenZPcysKWnBlMU1pbklNZjQrSHBNR28vRmhqbUk1eXZUY2gxckdqakZkRjN5Vkd2bGJOTzJjdGdiQTFTRGtEamxZcUFzRgpHa2VOOXIrUVJIZlVuZEJxUzNmMVFQam5aV1R0MWtPSVBaRWhnL1dWcUtxSm91d2tTR3Q2SXZrZFRybWo5eXhpCnNmM2pwR0JvdGJxMWd1enJ2Um5hSDhrMStXNXRVYzNnME5LNW5kMENIRHA4ckhHbkhyWkVnME9YZlFTUkcvM3IKb200PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
              name: eks_complete-example-prod
            
            contexts:
            - context:
                cluster: eks_complete-example-prod
                user: eks_complete-example-prod
              name: eks_complete-example-prod
            
            current-context: eks_complete-example-prod
            
            users:
            - name: eks_complete-example-prod
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "complete-example-prod"
        EOT
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_complete-example-prod"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [terraform-plan-05-aws-complete #22](https://github.com/pipetail/terraform/actions/runs/3549659595)